sim5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                                                                   |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 -1 -1)  // 0
    ( 1 -1 -1)  // 1
    ( 1  1 -1)  // 2
    (-1  1 -1)  // 3
    (-1 -1  1)  // 4
    ( 1 -1  1)  // 5
    ( 1  1  1)  // 6
    (-1  1  1)  // 7
);

blocks
(
    // X축 40등분, Y축 28등분, Z축 10등분으로 정사면체 비율 유지
    hex (0 1 2 3 4 5 6 7) (150 100 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // snappyHexMesh가 외부 경계를 지울 때 참조할 가상의 외부 벽면 정의
    baseOuterWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //