sim5/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Wall.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    { includedAngle   150; }
    writeObj            no; 
}

Inlet.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    { includedAngle   150; }
    writeObj            no;
}

Outlet.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    { includedAngle   150; }
    writeObj            no;
}